name: "clip_image_encoder"
platform: "tensorrt_plan"
max_batch_size: 4

input [
  { name: "image" data_type: TYPE_FP32 dims: [3, 224, 224] }
]

output [
  { name: "image_embedding" data_type: TYPE_FP32 dims: [512] }
]

instance_group [
  { kind: KIND_GPU count: 1 }
]

optimization {
  execution_accelerators {
    gpu_execution_accelerator: [
      { name: "tensorrt" parameters { key: "precision_mode" value: "FP16" } }
    ]
  }
}
