name: "clip_ensemble"
platform: "ensemble"
max_batch_size: 256

input [
  {
    name: "IMAGE_URLS"
    data_type: TYPE_STRING
    dims: [ -1 ]
  },
  {
    name: "TEXTS"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

output [
  {
    name: "similarity"
    data_type: TYPE_FP32
    dims: [ -1, -1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "clip_image_preprocessor"
      model_version: -1
      input_map {
        key: "IMAGE_URLS"
        value: "IMAGE_URLS"
      }
      output_map {
        key: "IMAGE_TENSOR"
        value: "IMAGE_TENSOR"
      }
    },
    {
      model_name: "clip_text_preprocessor"
      model_version: -1
      input_map {
        key: "TEXTS"
        value: "TEXTS"
      }
      output_map {
        key: "INPUT_IDS"
        value: "INPUT_IDS"
      }
    },
    {
      model_name: "clip_image_encoder"
      model_version: -1
      input_map {
        key: "image"
        value: "IMAGE_TENSOR"
      }
      output_map {
        key: "image_embedding"
        value: "IMAGE_EMB"
      }
    },
    {
      model_name: "clip_text_encoder"
      model_version: -1
      input_map {
        key: "text"
        value: "INPUT_IDS"
      }
      output_map {
        key: "text_embedding"
        value: "TEXT_EMB"
      }
    },
    {
      model_name: "clip_feature_merger"
      model_version: -1
      input_map {
        key: "image_emb"
        value: "IMAGE_EMB"
      }
      input_map {
        key: "text_emb"
        value: "TEXT_EMB"
      }
      output_map {
        key: "similarity"
        value: "similarity"
      }
    }
  ]
}
